src/exps/fio_benchmarks/paperexps/R-8G.log
rdm_w_nobuf: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
rdm_w_nobuf: (g=1): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.1.10
Starting 2 processes

rdm_w_nobuf: (groupid=0, jobs=1): err= 0: pid=10157: Thu Jul  4 21:39:43 2019
  write: io=731332KB, bw=4061.7KB/s, iops=1015, runt=180057msec
    clat (usec): min=55, max=407916, avg=980.29, stdev=12817.47
     lat (usec): min=55, max=407917, avg=980.69, stdev=12817.49
    clat percentiles (usec):
     |  1.00th=[   82],  5.00th=[   92], 10.00th=[   97], 20.00th=[   99],
     | 30.00th=[  100], 40.00th=[  102], 50.00th=[  103], 60.00th=[  104],
     | 70.00th=[  107], 80.00th=[  133], 90.00th=[  147], 95.00th=[  183],
     | 99.00th=[12992], 99.50th=[16768], 99.90th=[254976], 99.95th=[264192],
     | 99.99th=[288768]
    bw (KB  /s): min=   14, max=15328, per=100.00%, avg=4513.23, stdev=6625.47
    lat (usec) : 100=22.55%, 250=74.25%, 500=1.06%, 750=0.69%, 1000=0.03%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.02%, 20=0.89%, 50=0.16%
    lat (msec) : 100=0.01%, 250=0.22%, 500=0.12%
  cpu          : usr=0.62%, sys=1.87%, ctx=182838, majf=0, minf=7
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=182833/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
rdm_w_nobuf: (groupid=1, jobs=1): err= 0: pid=10186: Thu Jul  4 21:39:43 2019
  write: io=5308.0KB, bw=18104B/s, iops=4, runt=300227msec
    clat (usec): min=89, max=516189, avg=226218.22, stdev=82822.17
     lat (usec): min=89, max=516190, avg=226218.98, stdev=82822.21
    clat percentiles (usec):
     |  1.00th=[  104],  5.00th=[  426], 10.00th=[115200], 20.00th=[187392],
     | 30.00th=[220160], 40.00th=[234496], 50.00th=[242688], 60.00th=[252928],
     | 70.00th=[257024], 80.00th=[261120], 90.00th=[276480], 95.00th=[296960],
     | 99.00th=[481280], 99.50th=[505856], 99.90th=[514048], 99.95th=[518144],
     | 99.99th=[518144]
    bw (KB  /s): min=    7, max=  193, per=100.00%, avg=17.39, stdev=13.19
    lat (usec) : 100=0.38%, 250=4.22%, 500=0.53%, 750=0.08%
    lat (msec) : 4=0.08%, 10=0.15%, 20=0.08%, 50=0.23%, 100=0.75%
    lat (msec) : 250=49.96%, 500=42.95%, 750=0.60%
  cpu          : usr=0.01%, sys=0.02%, ctx=1338, majf=0, minf=38
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=1327/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=731332KB, aggrb=4061KB/s, minb=4061KB/s, maxb=4061KB/s, mint=180057msec, maxt=180057msec

Run status group 1 (all jobs):
  WRITE: io=5308KB, aggrb=17KB/s, minb=17KB/s, maxb=17KB/s, mint=300227msec, maxt=300227msec

Disk stats (read/write):
  sda: ios=79/184159, merge=0/0, ticks=1925/475996, in_queue=478364, util=99.30%