src/exps/fio_benchmarks/paperexps/tmp.log
job1: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 1 process

job1: (groupid=0, jobs=1): err= 0: pid=24795: Wed Sep 19 11:19:39 2018
  write: IOPS=147, BW=589KiB/s (603kB/s)(173MiB/300003msec)
    clat (usec): min=190, max=427447, avg=6781.91, stdev=5549.15
     lat (usec): min=190, max=427448, avg=6782.76, stdev=5549.15
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    4], 10.00th=[    5], 20.00th=[    5],
     | 30.00th=[    6], 40.00th=[    6], 50.00th=[    6], 60.00th=[    7],
     | 70.00th=[    7], 80.00th=[    8], 90.00th=[   10], 95.00th=[   14],
     | 99.00th=[   19], 99.50th=[   21], 99.90th=[  101], 99.95th=[  116],
     | 99.99th=[  188]
   bw (  KiB/s): min=  240, max=  888, per=100.00%, avg=588.82, stdev=65.26, samples=600
   iops        : min=   60, max=  222, avg=147.20, stdev=16.31, samples=600
  lat (usec)   : 250=0.17%, 500=0.19%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.10%, 4=9.42%, 10=81.56%, 20=7.96%, 50=0.42%
  lat (msec)   : 100=0.06%, 250=0.10%, 500=0.01%
  cpu          : usr=0.17%, sys=0.58%, ctx=44173, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,44160,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=589KiB/s (603kB/s), 589KiB/s-589KiB/s (603kB/s-603kB/s), io=173MiB (181MB), run=300003-300003msec

Disk stats (read/write):
  sdb: ios=42/44127, merge=0/0, ticks=567/296909, in_queue=297401, util=99.07%